Course0226/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Course0226/src/AccumulationRegisters/Товары/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает остатки номенклатуры на указанную дату по выбранным складам.
//
// Параметры:
//   ДатаАктуальности - Дата - момент времени, для которого определяется остаток
//   Номенклатура - СправочникСсылка.Номенклатура - номенклатурная позиция для проверки остатков
//   Склады - Массив или СписокЗначений - список складов, по которым нужно получить данные
//
// Возвращаемое значение:
//   Структура - соответствие складов и остатков количества (ключ - наименование склада без пробелов, значение - количество)
Функция ОстатокНоменклатуры(ДатаАктуальности, Номенклатура, Склады) Экспорт

	Результат = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыОстатки.Склад КАК Склад,
	|	ТоварыОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(&ДатаАктуальности, Номенклатура = &Ссылка И Склад В (&Склады)) КАК ТоварыОстатки";

	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);

	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Запрос.УстановитьПараметр("Склады", Склады);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(СтрЗаменить(Выборка.Склад, " ", ""), Выборка.Количество);
	КонецЦикла;

	Возврат Результат;
	Строка = "{
	|	""Сумма"": 100,
	|	""Количество"": 200,
	|	""Наименование"": ""Тапки""
	|	}";
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	ДанныеОбъекта = ПрочитатьJSON(ЧтениеJSON);
	
	Результат = Новый Структура;
	Результат.Вставить("НаименованиеТовара", ДанныеОбъекта.Наименование);
	Результат.Вставить("СуммаВсегоТовара", ДанныеОбъекта.Сумма);

	Сообщить(НСтр("ru='Привет мир!';en='Hello world!';zh='你好世界!';es='¡Hola mundo!'"));
	


КонецФункции

#КонецОбласти

#КонецЕсли
